Revit 2027 API
BuiltInFailures.LegendFailures.LegendComponentBadViewType Property
 Legend Components may only be placed in Legends
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LegendComponentBadViewType { get; }
Public Shared ReadOnly Property LegendComponentBadViewType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LegendComponentBadViewType {
	FailureDefinitionId^ get ();
}
static member LegendComponentBadViewType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LegendFailures Class
Autodesk.Revit.DB Namespace